<a href="https://colab.research.google.com/github/yahyalito/Ibrahim_Yahya_IP_Week_1_Core/blob/master/Ibrahim_Yahya_IP_Week_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
import matplotlib.pyplot as plt

In [0]:
finance = pd.read_csv("http://bit.ly/FinancialDataset")

In [45]:
finance.head()

  country  year  ...              Level of Educuation                Type of Job
0   Kenya  2018  ...              Secondary education              Self employed
1   Kenya  2018  ...              No formal education       Government Dependent
2   Kenya  2018  ...  Vocational/Specialised training              Self employed
3   Kenya  2018  ...                Primary education  Formally employed Private
4   Kenya  2018  ...                Primary education        Informally employed

[5 rows x 13 columns]

**Question**

which individuals are most likely to have or use a bank account

In [46]:
finance.shape

(23524, 13)

In [47]:
finance.tail()

      country  year  ...  Level of Educuation    Type of Job
23519  Uganda  2018  ...  No formal education   Other Income
23520  Uganda  2018  ...  Secondary education   Other Income
23521  Uganda  2018  ...    Primary education   Other Income
23522  Uganda  2018  ...  Secondary education  Self employed
23523  Uganda  2018  ...  Secondary education      No Income

[5 rows x 13 columns]

In [48]:
finance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23524 entries, 0 to 23523
Data columns (total 13 columns):
country                   23510 non-null object
year                      23524 non-null int64
uniqueid                  23524 non-null object
Has a Bank account        23488 non-null object
Type of Location          23509 non-null object
Cell Phone Access         23513 non-null object
household_size            23496 non-null float64
Respondent Age            23490 non-null float64
gender_of_respondent      23490 non-null object
The relathip with head    23520 non-null object
marital_status            23492 non-null object
Level of Educuation       23495 non-null object
Type of Job               23494 non-null object
dtypes: float64(2), int64(1), object(10)
memory usage: 2.3+ MB

In [49]:
#check missing values
finance.isna().sum()

country                   14
year                       0
uniqueid                   0
Has a Bank account        36
Type of Location          15
Cell Phone Access         11
household_size            28
Respondent Age            34
gender_of_respondent      34
The relathip with head     4
marital_status            32
Level of Educuation       29
Type of Job               30
dtype: int64

In [50]:
finance.shape

(23524, 13)

In [51]:
finance.rename(columns={"Has a Bank account":"Has_a_Bank_account",
                       "Type of Location" : "Type_of_Location",
                       "Cell Phone Access" : "Cell_Phone_Access",
                       "The relathip with head":"The_relationship_with_head",
                       "Level of Educuation" :"Level_of_Education",
                       "Type of Job" :"Type_of_Job",
                       "Respondent Age" : "Respondent_Age"} , inplace=True)
finance.head()

  country  year  ...               Level_of_Education                Type_of_Job
0   Kenya  2018  ...              Secondary education              Self employed
1   Kenya  2018  ...              No formal education       Government Dependent
2   Kenya  2018  ...  Vocational/Specialised training              Self employed
3   Kenya  2018  ...                Primary education  Formally employed Private
4   Kenya  2018  ...                Primary education        Informally employed

[5 rows x 13 columns]

In [0]:
finance_dropped = finance.dropna()

In [53]:
finance_dropped.shape

(23343, 13)

In [54]:
finance_dropped = finance_dropped.drop("uniqueid", axis=1)
finance_dropped.shape

(23343, 12)

In [0]:
#Checking for duplicates

finance_no_duplicate = finance_dropped.drop_duplicates()

In [56]:
finance_no_duplicate.shape

(18972, 12)

In [57]:
finance_dropped.country.value_counts()

Rwanda      8684
Tanzania    6500
Kenya       6064
Uganda      2095
Name: country, dtype: int64

In [83]:
#check for unique columns in the data frame
for i in finance_dropped.columns:
 print('\n')
 print(finance_dropped[i].unique())

['Kenya' 'Rwanda' 'Tanzania' 'Uganda']


[2018 2016 2017]


['Yes' 'No']


['Rural' 'Urban']


['Yes' 'No']


[ 3.  5.  8.  7.  1.  6.  4. 10.  2. 11.  9. 12. 16. 15. 13. 14. 21.  0.
 18. 17. 20.]


[ 24.  70.  26.  34.  32.  42.  54.  76.  40.  69.  64.  31.  38.  47.
  27.  48.  25.  21.  18.  22.  58.  55.  62.  29.  35.  45.  67.  19.
  80.  66.  50.  33.  28.  51.  16.  17.  30.  37.  59.  65.  46.  56.
  52.  23.  43.  49.  44.  72.  53.  63.  39.  81.  78.  36.  20.  60.
  95.  71.  57.  85.  68.  41.  61.  75.  86.  73.  93.  74.  88.  90.
  77.  84.  82.  89.  79.  83.  94.  87.  92.  91.  98.  97.  96.  99.
 100.]


['Female' 'Male']


['Spouse' 'Head of Household' 'Other relative' 'Child' 'Parent'
 'Other non-relatives']


['Married/Living together' 'Widowed' 'Single/Never Married'
 'Divorced/Seperated' 'Dont know']


['Secondary education' 'No formal education'
 'Vocational/Specialised training' 'Primary education'
 'Tertiary education' 'Other/Dont know/RTA' '6']


['Self employed' 'Government Dependent' 'Formally employed Private'
 'Informally employed' 'Formally employed Government'
 'Farming and Fishing' 'Remittance Dependent' 'Other Income'
 'Dont Know/Refuse to answer' 'No Income']

In [60]:
finance_dropped.groupby('country')['Level_of_Education'].value_counts()

country   Level_of_Education
Kenya     Primary education                  2596
          Secondary education                1785
          No formal education                 941
          Vocational/Specialised training     442
          Tertiary education                  292
          Other/Dont know/RTA                   8
Rwanda    Primary education                  4809
          No formal education                2105
          Secondary education                1485
          Tertiary education                  176
          Vocational/Specialised training      91
          6                                    18
Tanzania  Primary education                  4158
          No formal education                1102
          Tertiary education                  644
          Secondary education                 424
          Vocational/Specialised training     169
          6                                     3
Uganda    Primary education                  1126
          Secondary education                 513
          No formal education                 319
          Vocational/Specialised training      99
          Tertiary education                   32
          6                                     6
Name: Level_of_Education, dtype: int64

In [61]:
finance_dropped.Type_of_Location.value_counts()

Rural    14264
Urban     9079
Name: Type_of_Location, dtype: int64

In [62]:
list(finance_dropped['Level_of_Education'].unique())

['Secondary education',
 'No formal education',
 'Vocational/Specialised training',
 'Primary education',
 'Tertiary education',
 'Other/Dont know/RTA',
 '6']

In [63]:
list(finance_dropped['Level_of_Education'].unique())

['Secondary education',
 'No formal education',
 'Vocational/Specialised training',
 'Primary education',
 'Tertiary education',
 'Other/Dont know/RTA',
 '6']

In [64]:
finance_dropped.Level_of_Education.value_counts()

Primary education                  12689
No formal education                 4467
Secondary education                 4207
Tertiary education                  1144
Vocational/Specialised training      801
6                                     27
Other/Dont know/RTA                    8
Name: Level_of_Education, dtype: int64

In [65]:
list(finance_dropped['Type_of_Job'].unique())

['Self employed',
 'Government Dependent',
 'Formally employed Private',
 'Informally employed',
 'Formally employed Government',
 'Farming and Fishing',
 'Remittance Dependent',
 'Other Income',
 'Dont Know/Refuse to answer',
 'No Income']

In [66]:
list(finance_dropped['marital_status'].unique())

['Married/Living together',
 'Widowed',
 'Single/Never Married',
 'Divorced/Seperated',
 'Dont know']

In [67]:
list(finance_dropped['The_relationship_with_head'].unique())

['Spouse',
 'Head of Household',
 'Other relative',
 'Child',
 'Parent',
 'Other non-relatives']

In [68]:
list(finance_dropped['year'].unique())

[2018, 2029, 2056, 2016, 2039, 2017]

In [0]:
x = finance_dropped[finance_dropped['year'] > 2018].index
finance_dropped.drop(x, inplace = True)

In [70]:
list(finance_dropped['year'].unique())

[2018, 2016, 2017]

In [71]:
finance_dropped.year.value_counts()

2016    8683
2018    8157
2017    6500
Name: year, dtype: int64

**Analysis**

In [72]:
finance_dropped['Respondent_Age'].describe()

count    23340.000000
mean        38.807069
std         16.519905
min         16.000000
25%         26.000000
50%         35.000000
75%         49.000000
max        100.000000
Name: Respondent_Age, dtype: float64

In [73]:
finance_dropped['household_size'].describe()

count    23340.000000
mean         3.688560
std          2.281275
min          0.000000
25%          2.000000
50%          3.000000
75%          5.000000
max         21.000000
Name: household_size, dtype: float64

In [0]:
value_list = ['Kenya', 'Uganda', 'Rwanda' , 'Tanzania']

In [75]:
finance_dropped.groupby('country')['household_size'].describe()

           count      mean       std  min  25%  50%  75%   max
country
Kenya     6062.0  3.987133  2.334967  1.0  2.0  4.0  5.0  21.0
Rwanda    8683.0  4.482782  1.980386  1.0  3.0  4.0  6.0  13.0
Tanzania  6500.0  1.931692  1.055155  0.0  1.0  2.0  2.0  11.0
Uganda    2095.0  4.983771  2.893811  1.0  3.0  5.0  7.0  20.0

In [76]:
finance_dropped.groupby('country')['Respondent_Age'].describe()

           count       mean        std   min   25%   50%   75%    max
country
Kenya     6062.0  39.624051  17.215858  16.0  26.0  35.0  50.0   95.0
Rwanda    8683.0  39.278360  16.262093  16.0  27.0  35.0  49.0   99.0
Tanzania  6500.0  38.482462  16.441895  16.0  26.0  35.0  48.0  100.0
Uganda    2095.0  35.496897  15.304233  16.0  24.0  31.0  45.0   98.0